Tekla Open API Reference for Tekla Structures 2025
IUIEvents.Interrupted Event
 Occurs when user interrupts.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
event Events.InterruptedDelegate Interrupted
Event Interrupted As Events.InterruptedDelegate
Value
Type: Tekla.Structures.Drawing.UI.Events.InterruptedDelegate
See Also
Reference
IUIEvents Interface
Tekla.Structures.Drawing.UI Namespace